Terraform-Okta-IDP test (notice depreciation warning is gone)

`terraform apply`

```
var.idp_integration_name
  IdP integration name that will be shown in Control Plane.

  Enter a value: okta-gabriel-update

var.okta_app_name
  The name of the Okta Application that will be created.

  Enter a value: okta-gabriel-update

data.cyral_saml_certificate.this: Reading...
data.cyral_saml_certificate.this: Read complete after 3s [id=a2ebbf9XXXXXXXXXX662707c32]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.cyral_saml_configuration.this will be read during apply
  # (config refers to values not yet known)
 <= data "cyral_saml_configuration" "this" {
      + allowed_clock_skew                    = (known after apply)
      + back_channel_supported                = (known after apply)
      + base_64_saml_metadata_document        = (known after apply)
      + disable_force_authentication          = (known after apply)
      + disable_post_binding_authn_request    = (known after apply)
      + disable_post_binding_logout           = (known after apply)
      + disable_post_binding_response         = (known after apply)
      + disable_using_jwks_url                = (known after apply)
      + disable_validate_signature            = (known after apply)
      + disable_want_assertions_signed        = (known after apply)
      + disable_want_authn_requests_signed    = (known after apply)
      + gui_order                             = (known after apply)
      + hide_on_login_page                    = (known after apply)
      + id                                    = (known after apply)
      + ldap_group_attribute                  = (known after apply)
      + name_id_policy_format                 = (known after apply)
      + principal_type                        = (known after apply)
      + saml_xml_key_name_tranformer          = (known after apply)
      + signature_type                        = (known after apply)
      + signing_certificate                   = (known after apply)
      + single_logout_service_url             = (known after apply)
      + single_sign_on_service_url            = (known after apply)
      + sync_mode                             = (known after apply)
      + want_assertions_encrypted             = (known after apply)
      + xml_sig_key_info_key_name_transformer = (known after apply)
    }

  # cyral_integration_idp_saml.this will be created
  + resource "cyral_integration_idp_saml" "this" {
      + id                         = (known after apply)
      + idp_metadata_xml           = (known after apply)
      + saml_draft_id              = (known after apply)
      + single_sign_on_service_url = (known after apply)
    }

  # cyral_integration_idp_saml_draft.this will be created
  + resource "cyral_integration_idp_saml_draft" "this" {
      + disable_idp_initiated_login = false
      + display_name                = "gpereira"
      + id                          = (known after apply)
      + idp_type                    = "okta"
      + service_provider_metadata   = (known after apply)
      + sp_metadata                 = (known after apply)
    }

  # okta_app_saml.this will be created
  + resource "okta_app_saml" "this" {
      + accessibility_self_service  = false
      + acs_endpoints               = (known after apply)
      + assertion_signed            = true
      + audience                    = (known after apply)
      + authn_context_class_ref     = "urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport"
      + auto_submit_toolbar         = false
      + certificate                 = (known after apply)
      + destination                 = (known after apply)
      + digest_algorithm            = "SHA256"
      + embed_url                   = (known after apply)
      + entity_key                  = (known after apply)
      + entity_url                  = (known after apply)
      + features                    = (known after apply)
      + hide_ios                    = false
      + hide_web                    = false
      + honor_force_authn           = true
      + http_post_binding           = (known after apply)
      + http_redirect_binding       = (known after apply)
      + id                          = (known after apply)
      + key_id                      = (known after apply)
      + keys                        = (known after apply)
      + label                       = "gpereira"
      + logo_url                    = (known after apply)
      + metadata                    = (known after apply)
      + metadata_url                = (known after apply)
      + name                        = (known after apply)
      + recipient                   = (known after apply)
      + response_signed             = true
      + saml_signed_request_enabled = false
      + saml_version                = "2.0"
      + sign_on_mode                = (known after apply)
      + signature_algorithm         = "RSA_SHA256"
      + single_logout_certificate   = "XXXXXXXXXXXXX"
      + single_logout_issuer        = (known after apply)
      + single_logout_url           = (known after apply)
      + skip_groups                 = false
      + skip_users                  = false
      + sp_issuer                   = (known after apply)
      + sso_url                     = (known after apply)
      + status                      = "ACTIVE"
      + subject_name_id_format      = "urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress"
      + subject_name_id_template    = "${user.userName}"
      + user_name_template          = "${source.login}"
      + user_name_template_type     = "BUILT_IN"

      + attribute_statements {
          + name      = "EMAIL"
          + namespace = "urn:oasis:names:tc:SAML:2.0:attrname-format:basic"
          + type      = "EXPRESSION"
          + values    = [
              + "user.email",
            ]
        }
      + attribute_statements {
          + name      = "FIRST_NAME"
          + namespace = "urn:oasis:names:tc:SAML:2.0:attrname-format:basic"
          + type      = "EXPRESSION"
          + values    = [
              + "user.firstName",
            ]
        }
      + attribute_statements {
          + name      = "LAST_NAME"
          + namespace = "urn:oasis:names:tc:SAML:2.0:attrname-format:basic"
          + type      = "EXPRESSION"
          + values    = [
              + "user.lastName",
            ]
        }
      + attribute_statements {
          + filter_type  = "REGEX"
          + filter_value = ".*"
          + name         = "memberOf"
          + namespace    = "urn:oasis:names:tc:SAML:2.0:attrname-format:basic"
          + type         = "GROUP"
          + values       = []
        }
    }

  # random_uuid.this will be created
  + resource "random_uuid" "this" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + integration_idp_okta_id = (known after apply)
  + okta_app_saml_id        = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cyral_integration_idp_saml_draft.this: Creating...
random_uuid.this: Creating...
random_uuid.this: Creation complete after 0s [id=a6ea93XXXXXXXcb06048e63]
cyral_integration_idp_saml_draft.this: Creation complete after 2s [id=XXXXXX]
okta_app_saml.this: Creating...
okta_app_saml.this: Creation complete after 3s [id=XXXXX]
data.cyral_saml_configuration.this: Reading...
data.cyral_saml_configuration.this: Read complete after 0s [id=423d59b1-d9c5XXXXXXXX-7e70848f8407]
cyral_integration_idp_saml.this: Creating...
cyral_integration_idp_saml.this: Creation complete after 2s [id=XXXX]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

Outputs:

integration_idp_okta_id = "XXXXX"
okta_app_saml_id = "XXXXXX"
```

The proof of working propagation is in Jira ticket 👍🏻 